load-test.yml
config:
  target: "https://escuelajaguares.netlify.app"
  phases:
    # Fase 1: Horario de la mañana (8-10am) - Tráfico bajo
    - duration: 120
      arrivalRate: 2
      name: "Mañana - Tráfico bajo"
    
    # Fase 2: Media mañana (10-12pm) - Aumenta el tráfico
    - duration: 120
      arrivalRate: 5
      name: "Media mañana - Tráfico moderado"
    
    # Fase 3: Hora pico (12-2pm) - Más visitas (hora de almuerzo)
    - duration: 120
      arrivalRate: 10
      name: "Hora pico - Almuerzo"
    
    # Fase 4: Tarde (4-6pm) - Segundo pico (salida del trabajo)
    - duration: 120
      arrivalRate: 8
      name: "Tarde - Segundo pico"
    
    # Fase 5: Noche (8-10pm) - Tráfico nocturno
    - duration: 60
      arrivalRate: 3
      name: "Noche - Tráfico bajo"

scenarios:
  # Usuario que solo navega y se va (50% del tráfico)
  - name: "Visitante casual"
    weight: 50
    flow:
      - get:
          url: "/"
      - think: 8  # Lee la página principal
      - get:
          url: "/inscripcion.html"
      - think: 5  # Lee rápido y se va

  # Usuario interesado que explora varias páginas (30% del tráfico)
  - name: "Usuario interesado"
    weight: 30
    flow:
      - get:
          url: "/"
      - think: 10  # Lee la página principal
      - get:
          url: "/inscripcion.html"
      - think: 15  # Lee los detalles de inscripción
      - get:
          url: "/seleccion-horarios.html"
      - think: 20  # Revisa horarios con atención
      - get:
          url: "/inscripcion.html"
      - think: 5  # Vuelve a revisar

  # Usuario que consulta su inscripción (15% del tráfico)
  - name: "Consultar inscripción"
    weight: 15
    flow:
      - get:
          url: "/"
      - think: 3
      - get:
          url: "/consulta.html"
      - think: 10  # Busca su código y consulta

  # Usuario que va directo a inscribirse (5% del tráfico - más comprometido)
  - name: "Usuario decidido"
    weight: 5
    flow:
      - get:
          url: "/"
      - think: 5
      - get:
          url: "/inscripcion.html"
      - think: 25  # Llena el formulario completo
      - get:
          url: "/seleccion-horarios.html"
      - think: 30  # Selecciona horarios cuidadosamente
      - get:
          url: "/confirmacion.html"
      - think: 10  # Revisa confirmación